app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("coursename", "studentname", "coursemark", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["coursename", "English"], ["studentname", "YangHua"], ["coursemark", 85], ["created_at", "2017-11-12 05:32:44.723687"], ["updated_at", "2017-11-12 05:32:44.723687"]]